3d-wing-RAS-Spalart-Allmaras/system/addLayers

addLayersControls
{
    relativeSizes false;

    firstLayerThickness 1.600000e-04; 
    expansionRatio 1.166704; 
    minThickness 1.000000e-04; 

    layers
    {
        "wing"
        {
            nSurfaceLayers 20;
        }
    }

    nGrow 0;
    featureAngle 130; // 60

    slipFeatureAngle 30;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}
