3d-wing-RAS-Spalart-Allmaras/system/castellatedMeshSnap

geometry
{
    wing 
    {
        type triSurfaceMesh; // distributedTriSurfaceMesh;
        file "wing.stl";
    }

    wing_region
    {
        type triSurfaceMesh; // distributedTriSurfaceMesh;
        file "wing.stl";
    }
    sphere1 
    {
        type searchableSphere;
        centre          (0 0 0);
        radius          3.90;
    }
    sphere2
    {
        type searchableSphere;
        centre          (0 0 0);
        radius          7.02;
    }
    sphere3
    {
        type searchableSphere;
        centre          (0 0 0);
        radius          15.08;
    }

};


castellatedMeshControls
{

    maxLocalCells 500000;
    maxGlobalCells 100000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 3;

    features
    (
        {
            file "wing.eMesh";
            level 8;
        }
    );


    refinementSurfaces
    {
        wing 
        {
            level (8 8);
            patchInfo
            {
                type wall;
            }
        }
    }

    // Resolve sharp angles
    resolveFeatureAngle 30;

    refinementRegions
    {
        wing_region 
        {
            mode distance; 
            levels ( (0.1 8) (0.25 7) (0.5 6) );
        }
        sphere1 
        {
            mode inside;
            levels ((1E15 5));
        }
        sphere2
        {
            mode inside;
            levels ((1E15 3));
        }
        sphere3
        {
            mode inside;
            levels ((1E15 2));
        }
    }

    locationInMesh (-2.0863 0.134129 0.11239);
    allowFreeStandingZoneFaces true;
}


snapControls
{
    nSmoothPatch 6;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

