3d-wing-RAS-Spalart-Allmaras/system/meshQualityDict.ALLOFF
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshQualityDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Include defaults parameters from master dictionary
#includeEtc "caseDicts/mesh/generation/meshQualityDict"

maxNonOrtho 180;
maxBoundarySkewness -1;
maxInternalSkewness -1;
maxConcave 180;
minVol -1E30; 
minTetQuality -1E30; 
minArea -1;
minTwist -2; 
minDeterminant 0.0; 
minFaceWeight 0.0;
minVolRatio 0.0;
minTriangleTwist -1;

// ************************************************************************* //
