3d-wing-RAS-Spalart-Allmaras/system/snappyHexMeshDict.addLayers
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh false;
snap            false;
addLayers       true;

#include "./system/castellatedMeshSnap"
#include "./system/addLayers"

meshQualityControls
{
    #include "meshQualityDict.ALLOFF"
}

writeFlags
(
);

mergeTolerance 1e-6;


// ************************************************************************* //
