3d-wing-RAS-Spalart-Allmaras/system/surfacesRAS
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out surface files with interpolated field data in VTK format, e.g.
    cutting planes, iso-surfaces and patch boundary surfaces.
    This file includes a selection of example surfaces, each of which the user
    should configure and/or remove.
\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/visualization/surfaces.cfg"

fields       (p nuTilda U );

interpolationScheme cellPoint;
surfaceFormat       vtk;

#include "./system/allsurfaces"

// ************************************************************************* //
